Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/atdf/PIC32CM5164LS60064.atdf
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PM SUPC" caption="System peripherals shared interrupt"/>
        <interrupt name="WDT" index="1" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="2" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC_EXTINT_0" index="3" module-instance="EIC" caption="External Channel 0"/>
        <interrupt name="EIC_EXTINT_1" index="4" module-instance="EIC" caption="External Channel 1"/>
        <interrupt name="EIC_EXTINT_2" index="5" module-instance="EIC" caption="External Channel 2"/>
        <interrupt name="EIC_EXTINT_3" index="6" module-instance="EIC" caption="External Channel 3"/>
        <interrupt name="EIC_EXTINT_4" index="7" module-instance="EIC" caption="External Channel 4"/>
        <interrupt name="EIC_EXTINT_5" index="8" module-instance="EIC" caption="External Channel 5"/>
        <interrupt name="EIC_EXTINT_6" index="9" module-instance="EIC" caption="External Channel 6"/>
        <interrupt name="EIC_EXTINT_7" index="10" module-instance="EIC" caption="External Channel 7"/>
        <interrupt name="EIC_OTHER" index="11" module-instance="EIC" caption="External Channel 8..X"/>
        <interrupt name="FREQM" index="12" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="NVMCTRL" index="13" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="PORT" index="14" module-instance="PORT" caption="Port Non-Secure Check"/>
        <interrupt name="DMAC_0" index="15" module-instance="DMAC" caption="DMA Channel 0"/>
        <interrupt name="DMAC_1" index="16" module-instance="DMAC" caption="DMA Channel 1"/>
        <interrupt name="DMAC_2" index="17" module-instance="DMAC" caption="DMA Channel 2"/>
        <interrupt name="DMAC_3" index="18" module-instance="DMAC" caption="DMA Channel 3"/>
        <interrupt name="DMAC_OTHER" index="19" module-instance="DMAC" caption="DMA Channel 4..X"/>
        <interrupt name="USB" index="20" module-instance="USB" caption="Universal Serial Bus"/>
        <interrupt name="EVSYS_0" index="21" module-instance="EVSYS" caption="Event System Channel 0"/>
        <interrupt name="EVSYS_1" index="22" module-instance="EVSYS" caption="Event System Channel 1"/>
        <interrupt name="EVSYS_2" index="23" module-instance="EVSYS" caption="Event System Channel 2"/>
        <interrupt name="EVSYS_3" index="24" module-instance="EVSYS" caption="Event System Channel 3"/>
        <interrupt name="EVSYS_4" index="25" module-instance="EVSYS" caption="Event System Channel 4"/>
        <interrupt name="EVSYS_5" index="26" module-instance="EVSYS" caption="Event System Channel 5"/>
        <interrupt name="EVSYS_6" index="27" module-instance="EVSYS" caption="Event System Channel 6"/>
        <interrupt name="EVSYS_7" index="28" module-instance="EVSYS" caption="Event System Channel 7"/>
        <interrupt name="EVSYS_NSCHK" index="29" module-instance="EVSYS" caption="Event System Non-Secure Check"/>
        <interrupt name="PAC" index="30" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="SERCOM0_0" index="31" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_1" index="32" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_2" index="33" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_OTHER" index="34" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1_0" index="35" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_1" index="36" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_2" index="37" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_OTHER" index="38" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2_0" index="39" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_1" index="40" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_2" index="41" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_OTHER" index="42" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3_0" index="43" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_1" index="44" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_2" index="45" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_OTHER" index="46" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM4_0" index="47" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_1" index="48" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_2" index="49" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_OTHER" index="50" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM5_0" index="51" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_1" index="52" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_2" index="53" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_OTHER" index="54" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="TC0" index="55" module-instance="TC0" caption="Timer Counter 0"/>
        <interrupt name="TC1" index="56" module-instance="TC1" caption="Timer Counter 1"/>
        <interrupt name="TC2" index="57" module-instance="TC2" caption="Timer Counter 2"/>
        <interrupt name="TCC0" index="58" module-instance="TCC0" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC1" index="59" module-instance="TCC1" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC2" index="60" module-instance="TCC2" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC3" index="61" module-instance="TCC3" caption="TCC Match/Compare 3"/>
        <interrupt name="ADC_OTHER" index="62" module-instance="ADC" caption="Analog To Digital Converter"/>
        <interrupt name="ADC_RESRDY" index="63" module-instance="ADC" caption="ADC Result Ready"/>
        <interrupt name="AC" index="64" module-instance="AC" caption="Analog Comparator"/>
        <interrupt name="DAC_UNDERRUN" index="65" module-instance="DAC" caption="Digital to Analog Converter"/>
        <interrupt name="DAC_EMPTY" index="66" module-instance="DAC" caption="DAC Buffer 0 Empty"/>
        <interrupt name="PTC" index="67" module-instance="PTC" caption="Peripheral Touch Controller"/>
        <interrupt name="TRNG" index="68" module-instance="TRNG" caption="True Random Generator"/>
        <interrupt name="I2S" index="69" module-instance="I2S" caption="Inter-IC Sound Interface"/>
        <interrupt name="TRAM" index="70" module-instance="TRAM" caption="Trust Ram"/>
      </interrupts>
      <events>
        <generators>
          <generator name="OSCCTRL_XOSC_FAIL" index="1" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="2" module-instance="OSC32KCTRL"/>
          <generator name="SUPC_BOD33DET" index="3" module-instance="SUPC"/>
          <generator name="RTC_PER_0" index="4" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="11" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="12" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="13" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="14" module-instance="RTC"/>
          <generator name="RTC_OVF" index="15" module-instance="RTC"/>
          <generator name="RTC_PERD" index="16" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="30" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="31" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="32" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="33" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="34" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="35" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="36" module-instance="DMAC"/>
          <generator name="DMAC_CH_4" index="37" module-instance="DMAC"/>
          <generator name="DMAC_CH_5" index="38" module-instance="DMAC"/>
          <generator name="DMAC_CH_6" index="39" module-instance="DMAC"/>
          <generator name="DMAC_CH_7" index="40" module-instance="DMAC"/>
          <generator name="TC0_OVF" index="41" module-instance="TC0"/>
          <generator name="TC0_MC_0" index="42" module-instance="TC0"/>
          <generator name="TC0_MC_1" index="43" module-instance="TC0"/>
          <generator name="TC1_OVF" index="44" module-instance="TC1"/>
          <generator name="TC1_MC_0" index="45" module-instance="TC1"/>
          <generator name="TC1_MC_1" index="46" module-instance="TC1"/>
          <generator name="TC2_OVF" index="47" module-instance="TC2"/>
          <generator name="TC2_MC_0" index="48" module-instance="TC2"/>
          <generator name="TC2_MC_1" index="49" module-instance="TC2"/>
          <generator name="TCC0_TRG" index="50" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="51" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="52" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="53" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="54" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="55" module-instance="TCC0"/>
          <generator name="TCC0_OVF" index="56" module-instance="TCC0"/>
          <generator name="TCC1_TRG" index="57" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="58" module-instance="TCC1"/>
          <generator name="TCC1_MC_0" index="59" module-instance="TCC1"/>
          <generator name="TCC1_MC_1" index="60" module-instance="TCC1"/>
          <generator name="TCC1_OVF" index="61" module-instance="TCC1"/>
          <generator name="TCC2_TRG" index="62" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="63" module-instance="TCC2"/>
          <generator name="TCC2_MC_0" index="64" module-instance="TCC2"/>
          <generator name="TCC2_MC_1" index="65" module-instance="TCC2"/>
          <generator name="TCC2_OVF" index="66" module-instance="TCC2"/>
          <generator name="TCC3_TRG" index="67" module-instance="TCC3"/>
          <generator name="TCC3_CNT" index="68" module-instance="TCC3"/>
          <generator name="TCC3_MC_0" index="69" module-instance="TCC3"/>
          <generator name="TCC3_MC_1" index="70" module-instance="TCC3"/>
          <generator name="TCC3_MC_2" index="71" module-instance="TCC3"/>
          <generator name="TCC3_MC_3" index="72" module-instance="TCC3"/>
          <generator name="TCC3_OVF" index="73" module-instance="TCC3"/>
          <generator name="ADC_RESRDY" index="74" module-instance="ADC"/>
          <generator name="ADC_WINMON" index="75" module-instance="ADC"/>
          <generator name="AC_COMP_0" index="76" module-instance="AC"/>
          <generator name="AC_COMP_1" index="77" module-instance="AC"/>
          <generator name="AC_COMP_2" index="78" module-instance="AC"/>
          <generator name="AC_COMP_3" index="79" module-instance="AC"/>
          <generator name="AC_WIN_0" index="80" module-instance="AC"/>
          <generator name="AC_WIN_1" index="81" module-instance="AC"/>
          <generator name="DAC_EMPTY_0" index="82" module-instance="DAC"/>
          <generator name="DAC_EMPTY_1" index="83" module-instance="DAC"/>
          <generator name="PTC_EOC" index="84" module-instance="PTC"/>
          <generator name="PTC_WCOMP" index="85" module-instance="PTC"/>
          <generator name="TRNG_READY" index="86" module-instance="TRNG"/>
          <generator name="CCL_LUTOUT_0" index="87" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="88" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="89" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="90" module-instance="CCL"/>
          <generator name="PAC_ACCERR" index="91" module-instance="PAC"/>
        </generators>
        <users>
          <user name="OSCCTRL_TUNE" index="0" module-instance="OSCCTRL"/>
          <user name="RTC_TAMPER" index="1" module-instance="RTC"/>
          <user name="NVMCTRL_PAGEW" index="2" module-instance="NVMCTRL"/>
          <user name="PORT_EV_0" index="3" module-instance="PORT"/>
          <user name="PORT_EV_1" index="4" module-instance="PORT"/>
          <user name="PORT_EV_2" index="5" module-instance="PORT"/>
          <user name="PORT_EV_3" index="6" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="8" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="9" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="10" module-instance="DMAC"/>
          <user name="DMAC_CH_4" index="11" module-instance="DMAC"/>
          <user name="DMAC_CH_5" index="12" module-instance="DMAC"/>
          <user name="DMAC_CH_6" index="13" module-instance="DMAC"/>
          <user name="DMAC_CH_7" index="14" module-instance="DMAC"/>
          <user name="TC0_EVU" index="15" module-instance="TC0"/>
          <user name="TC1_EVU" index="16" module-instance="TC1"/>
          <user name="TC2_EVU" index="17" module-instance="TC2"/>
          <user name="TCC0_EV_0" index="18" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="19" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="20" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="21" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="22" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="23" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="24" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="25" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="26" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="27" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="28" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="29" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="30" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="31" module-instance="TCC2"/>
          <user name="TCC3_EV_0" index="32" module-instance="TCC3"/>
          <user name="TCC3_EV_1" index="33" module-instance="TCC3"/>
          <user name="TCC3_MC_0" index="34" module-instance="TCC3"/>
          <user name="TCC3_MC_1" index="35" module-instance="TCC3"/>
          <user name="TCC3_MC_2" index="36" module-instance="TCC3"/>
          <user name="TCC3_MC_3" index="37" module-instance="TCC3"/>
          <user name="ADC_START" index="38" module-instance="ADC"/>
          <user name="ADC_SYNC" index="39" module-instance="ADC"/>
          <user name="AC_SOC_0" index="40" module-instance="AC"/>
          <user name="AC_SOC_1" index="41" module-instance="AC"/>
          <user name="AC_SOC_2" index="42" module-instance="AC"/>
          <user name="AC_SOC_3" index="43" module-instance="AC"/>
          <user name="DAC_START_0" index="44" module-instance="DAC"/>
          <user name="DAC_START_1" index="45" module-instance="DAC"/>
          <user name="PTC_STCONV" index="46" module-instance="PTC"/>
          <user name="PTC_DSEQR" index="47" module-instance="PTC"/>
          <user name="CCL_LUTIN_0" index="48" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="49" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="50" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="51" module-instance="CCL"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x20870001"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.0.2" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
          <bitfield name="START2" caption="Comparator 2 Start Comparison" mask="0x4"/>
          <bitfield name="START3" caption="Comparator 3 Start Comparison" mask="0x8"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="COMPEO2" caption="Comparator 2 Event Output Enable" mask="0x4"/>
          <bitfield name="COMPEO3" caption="Comparator 3 Event Output Enable" mask="0x8"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="WINEO1" caption="Window 1 Event Output Enable" mask="0x20"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="COMPEI2" caption="Comparator 2 Event Input Enable" mask="0x400"/>
          <bitfield name="COMPEI3" caption="Comparator 3 Event Input Enable" mask="0x800"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
          <bitfield name="INVEI2" caption="Comparator 2 Input Event Invert Enable" mask="0x4000"/>
          <bitfield name="INVEI3" caption="Comparator 3 Input Event Invert Enable" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="COMP2" caption="Comparator 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="COMP3" caption="Comparator 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="WIN1" caption="Window 1 Interrupt Enable" mask="0x20"/>
        </register>
