Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/atdf/PIC32CM5164LS60064.atdf
        <register name="BTCNT" offset="0x2" rw="RW" size="2" caption="Block Transfer Count">
          <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
        </register>
        <register name="SRCADDR" offset="0x4" rw="RW" size="4" caption="Block Transfer Source Address">
          <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DSTADDR" offset="0x8" rw="RW" size="4" caption="Block Transfer Destination Address">
          <bitfield name="DSTADDR" caption="Transfer Destination Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DESCADDR" offset="0xC" rw="RW" size="4" caption="Next Descriptor Address">
          <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="DMAC_PRICTRL__RRLVLEN0">
        <value name="STATIC_LVL" caption="Static arbitration scheme for channels with level 0 priority" value="0x0"/>
        <value name="ROUND_ROBIN_LVL" caption="Round-robin arbitration scheme for channels with level 0 priority" value="0x1"/>
      </value-group>
      <value-group name="DMAC_PRICTRL__RRLVLEN1">
        <value name="STATIC_LVL" caption="Static arbitration scheme for channels with level 1 priority" value="0x0"/>
        <value name="ROUND_ROBIN_LVL" caption="Round-robin arbitration scheme for channels with level 1 priority" value="0x1"/>
      </value-group>
      <value-group name="DMAC_PRICTRL__RRLVLEN2">
        <value name="STATIC_LVL" caption="Static arbitration scheme for channels with level 2 priority" value="0x0"/>
        <value name="ROUND_ROBIN_LVL" caption="Round-robin arbitration scheme for channels with level 2 priority" value="0x1"/>
      </value-group>
      <value-group name="DMAC_PRICTRL__RRLVLEN3">
        <value name="STATIC_LVL" caption="Static arbitration scheme for channels with level 3 priority" value="0x0"/>
        <value name="ROUND_ROBIN_LVL" caption="Round-robin arbitration scheme for channels with level 3 priority" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BLOCKACT">
        <value name="NOACT" caption="Channel will be disabled if it is the last block transfer in the transaction" value="0x0"/>
        <value name="INT" caption="Channel will be disabled if it is the last block transfer in the transaction and block interrupt" value="0x1"/>
        <value name="SUSPEND" caption="Channel suspend operation is completed" value="0x2"/>
        <value name="BOTH" caption="Both channel suspend operation and block interrupt" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__EVOSEL">
        <value name="DISABLE" caption="Event generation disabled" value="0x0"/>
        <value name="BLOCK" caption="Event strobe when block transfer complete" value="0x1"/>
        <value name="BEAT" caption="Event strobe when beat transfer complete" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSEL">
        <value name="DST" caption="Step size settings apply to the destination address" value="0x0"/>
        <value name="SRC" caption="Step size settings apply to the source address" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSIZE">
        <value name="X1" caption="Next ADDR = ADDR + (Beat Size in byte) * 1" value="0x0"/>
        <value name="X2" caption="Next ADDR = ADDR + (Beat Size in byte) * 2" value="0x1"/>
        <value name="X4" caption="Next ADDR = ADDR + (Beat Size in byte) * 4" value="0x2"/>
        <value name="X8" caption="Next ADDR = ADDR + (Beat Size in byte) * 8" value="0x3"/>
        <value name="X16" caption="Next ADDR = ADDR + (Beat Size in byte) * 16" value="0x4"/>
        <value name="X32" caption="Next ADDR = ADDR + (Beat Size in byte) * 32" value="0x5"/>
        <value name="X64" caption="Next ADDR = ADDR + (Beat Size in byte) * 64" value="0x6"/>
        <value name="X128" caption="Next ADDR = ADDR + (Beat Size in byte) * 128" value="0x7"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCBEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCPOLY">
        <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0"/>
        <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCSRC">
        <value name="NOACT" caption="No action" value="0x00"/>
        <value name="IO" caption="I/O interface" value="0x01"/>
        <value name="CHN0" caption="DMA Channel 0" value="0x20"/>
        <value name="CHN1" caption="DMA Channel 1" value="0x21"/>
        <value name="CHN2" caption="DMA Channel 2" value="0x22"/>
        <value name="CHN3" caption="DMA Channel 3" value="0x23"/>
        <value name="CHN4" caption="DMA Channel 4" value="0x24"/>
        <value name="CHN5" caption="DMA Channel 5" value="0x25"/>
        <value name="CHN6" caption="DMA Channel 6" value="0x26"/>
        <value name="CHN7" caption="DMA Channel 7" value="0x27"/>
        <value name="CHN8" caption="DMA Channel 8" value="0x28"/>
        <value name="CHN9" caption="DMA Channel 9" value="0x29"/>
        <value name="CHN10" caption="DMA Channel 10" value="0x2A"/>
        <value name="CHN11" caption="DMA Channel 11" value="0x2B"/>
        <value name="CHN12" caption="DMA Channel 12" value="0x2C"/>
        <value name="CHN13" caption="DMA Channel 13" value="0x2D"/>
        <value name="CHN14" caption="DMA Channel 14" value="0x2E"/>
        <value name="CHN15" caption="DMA Channel 15" value="0x2F"/>
      </value-group>
